import datetime

market_holidays = {
    2022: [
        "20220101", "20220102", "20220103",  # 元旦
        "20220131", "20220201", "20220202", "20220203", "20220204", "20220205", "20220206",  # 春节
        "20220403", "20220404", "20220405",  # 清明节
        "20220430", "20220501", "20220502", "20220503", "20220504",  # 劳动节
        "20220603", "20220604", "20220605",  # 端午节
        "20220910", "20220911", "20220912",  # 中秋节
        "20221001", "20221002", "20221003", "20221004", "20221005", "20221006", "20221007"  # 国庆节
    ],
    2023: [
        "20221231", "20230101", "20230102",  # 元旦
        "20230121", "20230122", "20230123", "20230124", "20230125", "20230126", "20230127",  # 春节
        "20230405",  # 清明节
        "20230429", "20230430", "20230501", "20230502", "20230503",  # 劳动节
        "20230622", "20230623", "20230624",  # 端午节
        "20230929", "20230930", "20231001", "20231002", "20231003", "20231004", "20231005", "20231006"  # 中秋节和国庆节
    ],
    2024: [
        "20231230", "20231231", "20240101",  # 元旦
        "20240209", "20240210", "20240211", "20240212", "20240213", "20240214", "20240215", "20240216", "20240217",  # 春节
        "20240404", "20240405", "20240406",  # 清明节
        "20240501", "20240502", "20240503", "20240504", "20240505",  # 劳动节
        "20240610",  # 端午节
        "20240915", "20240916", "20240917",  # 中秋节
        "20241001", "20241002", "20241003", "20241004", "20241005", "20241006", "20241007"  # 国庆节
    ]
}
def create_date_list(start, end):
    start_year = int(start.split('-')[0])
    start_month = int(start.split('-')[1])
    start_day = int(start.split('-')[2])
    end_year = int(end.split('-')[0])
    end_month = int(end.split('-')[1])
    end_day = int(end.split('-')[2])
    start_date = datetime.date(start_year, start_month, start_day)
    print(start_date)
    end_date = datetime.date(end_year, end_month, end_day)  # 修改为整年
    print(end_date)
    all_dates = [start_date + datetime.timedelta(days=x) for x in range((end_date - start_date).days + 1)]
    # 生成格式为 YYYYMMDD 的非节假日期列表，并排除周六和周日
    non_holiday_dates = [
        date.strftime("%Y-%m-%d") for date in all_dates 
        if date.strftime("%Y%m%d") not in market_holidays.get(date.year, []) and date.weekday() < 5
    ]
    return non_holiday_dates

non_holiday_dates = create_date_list('2024-04-01', '2024-06-04')
print(non_holiday_dates)
